## Translation of Thailand's 2016-2019 data

In [143]:
import csv
import sys
import os
import pandas as pd
import numpy as np
from datetime import datetime

import string
from googletrans import Translator

In [ ]:
print(sys.executable)
os.chdir(r"C:\Users\ggk\FYP-TouristArrivalsPrediction\dataset")
# load the dataset
data10to16 = pd.read_csv(r"thaitourism2.csv")
data10to16.head(20)

data16to19 = pd.read_excel(r"Summary of the number of foreign tourists in 2016 - 2019.xlsx")
data16to19.head(20)

In [135]:
y = [2019, 2018, 2017, 2016]
yrMon = []

In [136]:
year = []
for ye in y:
    for i in range(12):
        year.append(ye)

len(year)

48

In [137]:
month = []
for i in range(4):
    for m in data16to19.iloc[2:14, 0]:
        month.append(m)

len(month)

48

In [ ]:
arrivals = []
for i in range(4):
    for a in data16to19.iloc[2:14, i+1]:
        print(a)
        arrivals.append(a)

In [214]:
tdf = pd.DataFrame({'Year': year, 'Month': month, 'Arrivals': arrivals})
tdf['Month'] = tdf['Month'].apply(lambda x: datetime.strptime(x, '%B').month)
tdf

    Year  Month   Arrivals
0   2019      1  3713172.0
1   2019      2  3600922.0
2   2019      3  3478687.0
3   2019      4  3216929.0
4   2019      5  2736598.0
5   2019      6  3056697.0
6   2019      7  3342750.0
7   2019      8  3472655.0
8   2019      9  2890039.0
9   2019     10  3074099.0
10  2019     11  3386366.0
11  2019     12  3947337.0
12  2018      1  3531483.0
13  2018      2  3552119.0
14  2018      3  3494645.0
15  2018      4  3096067.0
16  2018      5  2737834.0
17  2018      6  3013304.0
18  2018      7  3177088.0
19  2018      8  3229031.0
20  2018      9  2636115.0
21  2018     10  2704002.0
22  2018     11  3170996.0
23  2018     12  3835510.0
24  2017      1  3197053.0
25  2017      2  2966522.0
26  2017      3  3018411.0
27  2017      4  2853288.0
28  2017      5  2600624.0
29  2017      6  2731072.0
30  2017      7  3099409.0
31  2017      8  3188148.0
32  2017      9  2600279.0
33  2017     10  2725943.0
34  2017     11  3039567.0
35  2017     12  3571662.0
36  2016      1  2996442.0
37  2016      2  3080535.0
38  2016      3  2927226.0
39  2016      4  2627809.0
40  2016      5  2459093.0
41  2016      6  2422998.0
42  2016      7  2949102.0
43  2016      8  2883594.0
44  2016      9  2416821.0
45  2016     10  2252775.0
46  2016     11  2452457.0
47  2016     12  3060736.0

In [187]:
data10to16['yeMon'] = data10to16['year'].map(str) + '-' + data10to16['month'].map(str)
data10to16

      region nationality  year  month  tourists    yeMon
0     Africa   AfrOthers  2010      1      6553   2010-1
1     Africa   AfrOthers  2010      2      5618   2010-2
2     Africa   AfrOthers  2010      3      6689   2010-3
3     Africa   AfrOthers  2010      4      5210   2010-4
4     Africa   AfrOthers  2010      5      4537   2010-5
...      ...         ...   ...    ...       ...      ...
4447  SoAsia    SriLanka  2016      8      6040   2016-8
4448  SoAsia    SriLanka  2016      9      5221   2016-9
4449  SoAsia    SriLanka  2016     10      4285  2016-10
4450  SoAsia    SriLanka  2016     11      4808  2016-11
4451  SoAsia    SriLanka  2016     12      6522  2016-12

[4452 rows x 6 columns]

In [188]:
len(pd.unique(data10to16["nationality"]))
fdf = data10to16.drop(["region", "nationality"], axis=1)
fdf

      year  month  tourists    yeMon
0     2010      1      6553   2010-1
1     2010      2      5618   2010-2
2     2010      3      6689   2010-3
3     2010      4      5210   2010-4
4     2010      5      4537   2010-5
...    ...    ...       ...      ...
4447  2016      8      6040   2016-8
4448  2016      9      5221   2016-9
4449  2016     10      4285  2016-10
4450  2016     11      4808  2016-11
4451  2016     12      6522  2016-12

[4452 rows x 4 columns]

In [208]:
fdff = fdf.groupby(by="yeMon")["tourists"].sum()
adf = pd.DataFrame(fdff)
adf

         tourists
yeMon
2010-1    1605505
2010-10   1316806
2010-11   1478856
2010-12   1819751
2010-2    1614844
...           ...
2016-5    2476505
2016-6    2433255
2016-7    2946286
2016-8    2874420
2016-9    2407572

[84 rows x 1 columns]

In [ ]:
adf['Year'] = adf['yeMon'].str.slice(start=0, stop=4)

In [213]:
#Export the DataFrame to CSV file
adf.to_csv('test')

#Print the Pandas DataFrame that is exported
f=pd.read_csv('test')
f

      yeMon  tourists
0    2010-1   1605505
1   2010-10   1316806
2   2010-11   1478856
3   2010-12   1819751
4    2010-2   1614844
..      ...       ...
79   2016-5   2476505
80   2016-6   2433255
81   2016-7   2946286
82   2016-8   2874420
83   2016-9   2407572

[84 rows x 2 columns]

In [141]:
translator = Translator()
# with open("C:/Users/ggk/FYP-TouristArrivalsPrediction/dataset/tourist2016-2019.xlsx", "r", encoding="TIS-620") as file:
  # csvreader = pd.read_excel(file)
for row in data16to19.iloc[0]:
  print("original", row)
  try:
    tranRow = translator.translate(row[0], dest="en")
    print("trans", tranRow)
  except:
    print("still ori", row)

original nan
still ori nan
original Number (persons)
still ori Number (persons)
original nan
still ori nan
original nan
still ori nan
original nan
still ori nan
original  %CH (Y-o-Y)
still ori  %CH (Y-o-Y)
original nan
still ori nan
original nan
still ori nan